# Гусейнов Тагир НБИ 03.23.
# Лабораторная номер 5, Билет 4, Задание 1

import numpy as np

# Определите узлы и значения функции
x = [0, 1, 3]
y = [2, 0.86603, 4]

# Определите значения параметров для кубического сплайна
t = np.array([0, 1, 2, 3])

# Определите коэффициенты кубического сплайна
a = np.zeros((4, 4))
b = np.zeros((4,))

# Задайте граничные условия: нулевая кривизна при x=1 и x=3
a[1, 0] = 1
a[2, 0] = 1

# Вычислите коэффициенты кубического сплайна, используя граничные условия
for i in range(2):
    a[i+1, 1] = (y[i+1] - y[i]) / (t[i+1] - t[i])
    b[i+1] = y[i+1]

# Оцените кубический сплайн при x=1,5
x_new = 1.5
t_new = (t[2] - t[0]) * (x_new - t[0]) / (t[2] - t[0]) + t[0]
y_new = a[0, 0] + a[0, 1]*(x_new-t[0]) + a[0, 2]*(x_new-t[0])**2 + a[0, 3]*(x_new-t[0])**3

print("Value of the cubic spline at x=1.5:", y_new)